apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_uart.h
/****************************************************************************
 * arch/arm/src/stm32h5/hardware/stm32h5xxx_uart.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5XXX_UART_H
#define __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5XXX_UART_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_USART_CR1_OFFSET    0x0000  /* Control register 1 */
#define STM32_USART_CR2_OFFSET    0x0004  /* Control register 2 */
#define STM32_USART_CR3_OFFSET    0x0008  /* Control register 3 */
#define STM32_USART_BRR_OFFSET    0x000c  /* Baud Rate register */
#define STM32_USART_GTPR_OFFSET   0x0010  /* Guard time and prescaler register */
#define STM32_USART_RTOR_OFFSET   0x0014  /* Receiver timeout register */
#define STM32_USART_RQR_OFFSET    0x0018  /* Request register */
#define STM32_USART_ISR_OFFSET    0x001c  /* Interrupt and status register */
#define STM32_USART_ICR_OFFSET    0x0020  /* Interrupt flag clear register */
#define STM32_USART_RDR_OFFSET    0x0024  /* Receive Data register */
#define STM32_USART_TDR_OFFSET    0x0028  /* Transmit Data register */
#define STM32_USART_PRESC_OFFSET  0x002c  /* Prescaler register */

/* Register Addresses *******************************************************/

#if STM32_NLPUART > 0
#  define STM32_LPUART1_CR1        (STM32_LPUART1_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_LPUART1_CR2        (STM32_LPUART1_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_LPUART1_CR3        (STM32_LPUART1_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_LPUART1_BRR        (STM32_LPUART1_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_LPUART1_GTPR       (STM32_LPUART1_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_LPUART1_RTOR       (STM32_LPUART1_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_LPUART1_RQR        (STM32_LPUART1_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_LPUART1_ISR        (STM32_LPUART1_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_LPUART1_ICR        (STM32_LPUART1_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_LPUART1_RDR        (STM32_LPUART1_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_LPUART1_TDR        (STM32_LPUART1_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_LPUART1_PRESC      (STM32_LPUART1_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUSART > 0
#  define STM32_USART1_CR1        (STM32_USART1_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_USART1_CR2        (STM32_USART1_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_USART1_CR3        (STM32_USART1_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_USART1_BRR        (STM32_USART1_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_USART1_GTPR       (STM32_USART1_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_USART1_RTOR       (STM32_USART1_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_USART1_RQR        (STM32_USART1_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_USART1_ISR        (STM32_USART1_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_USART1_ICR        (STM32_USART1_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_USART1_RDR        (STM32_USART1_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_USART1_TDR        (STM32_USART1_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_USART1_PRESC      (STM32_USART1_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUSART > 1
#  define STM32_USART2_CR1        (STM32_USART2_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_USART2_CR2        (STM32_USART2_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_USART2_CR3        (STM32_USART2_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_USART2_BRR        (STM32_USART2_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_USART2_GTPR       (STM32_USART2_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_USART2_RTOR       (STM32_USART2_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_USART2_RQR        (STM32_USART2_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_USART2_ISR        (STM32_USART2_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_USART2_ICR        (STM32_USART2_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_USART2_RDR        (STM32_USART2_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_USART2_TDR        (STM32_USART2_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_USART2_PRESC      (STM32_USART2_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUSART > 2
#  define STM32_USART3_CR1        (STM32_USART3_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_USART3_CR2        (STM32_USART3_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_USART3_CR3        (STM32_USART3_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_USART3_BRR        (STM32_USART3_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_USART3_GTPR       (STM32_USART3_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_USART3_RTOR       (STM32_USART3_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_USART3_RQR        (STM32_USART3_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_USART3_ISR        (STM32_USART3_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_USART3_ICR        (STM32_USART3_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_USART3_RDR        (STM32_USART3_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_USART3_TDR        (STM32_USART3_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_USART3_PRESC      (STM32_USART3_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUSART > 4
#  define STM32_USART6_CR1        (STM32_USART6_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_USART6_CR2        (STM32_USART6_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_USART6_CR3        (STM32_USART6_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_USART6_BRR        (STM32_USART6_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_USART6_GTPR       (STM32_USART6_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_USART6_RTOR       (STM32_USART6_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_USART6_RQR        (STM32_USART6_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_USART6_ISR        (STM32_USART6_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_USART6_ICR        (STM32_USART6_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_USART6_RDR        (STM32_USART6_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_USART6_TDR        (STM32_USART6_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_USART6_PRESC      (STM32_USART6_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUSART > 5
#  define STM32_USART10_CR1        (STM32_USART10_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_USART10_CR2        (STM32_USART10_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_USART10_CR3        (STM32_USART10_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_USART10_BRR        (STM32_USART10_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_USART10_GTPR       (STM32_USART10_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_USART10_RTOR       (STM32_USART10_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_USART10_RQR        (STM32_USART10_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_USART10_ISR        (STM32_USART10_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_USART10_ICR        (STM32_USART10_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_USART10_RDR        (STM32_USART10_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_USART10_TDR        (STM32_USART10_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_USART10_PRESC      (STM32_USART10_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUSART > 6
#  define STM32_USART11_CR1        (STM32_USART11_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_USART11_CR2        (STM32_USART11_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_USART11_CR3        (STM32_USART11_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_USART11_BRR        (STM32_USART11_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_USART11_GTPR       (STM32_USART11_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_USART11_RTOR       (STM32_USART11_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_USART11_RQR        (STM32_USART11_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_USART11_ISR        (STM32_USART11_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_USART11_ICR        (STM32_USART11_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_USART11_RDR        (STM32_USART11_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_USART11_TDR        (STM32_USART11_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_USART11_PRESC      (STM32_USART11_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUART > 0
#  define STM32_UART4_CR1         (STM32_UART4_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART4_CR2         (STM32_UART4_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART4_CR3         (STM32_UART4_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART4_BRR         (STM32_UART4_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART4_GTPR        (STM32_UART4_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART4_RTOR        (STM32_UART4_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART4_RQR         (STM32_UART4_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART4_ISR         (STM32_UART4_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART4_ICR         (STM32_UART4_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART4_RDR         (STM32_UART4_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART4_TDR         (STM32_UART4_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_UART4_PRESC       (STM32_UART4_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUART > 1
#  define STM32_UART5_CR1         (STM32_UART5_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART5_CR2         (STM32_UART5_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART5_CR3         (STM32_UART5_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART5_BRR         (STM32_UART5_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART5_GTPR        (STM32_UART5_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART5_RTOR        (STM32_UART5_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART5_RQR         (STM32_UART5_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART5_ISR         (STM32_UART5_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART5_ICR         (STM32_UART5_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART5_RDR         (STM32_UART5_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART5_TDR         (STM32_UART5_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_UART5_PRESC       (STM32_UART5_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUART > 2
#  define STM32_UART7_CR1         (STM32_UART7_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART7_CR2         (STM32_UART7_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART7_CR3         (STM32_UART7_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART7_BRR         (STM32_UART7_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART7_GTPR        (STM32_UART7_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART7_RTOR        (STM32_UART7_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART7_RQR         (STM32_UART7_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART7_ISR         (STM32_UART7_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART7_ICR         (STM32_UART7_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART7_RDR         (STM32_UART7_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART7_TDR         (STM32_UART7_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_UART7_PRESC       (STM32_UART7_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUART > 3
#  define STM32_UART8_CR1         (STM32_UART8_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART8_CR2         (STM32_UART8_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART8_CR3         (STM32_UART8_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART8_BRR         (STM32_UART8_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART8_GTPR        (STM32_UART8_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART8_RTOR        (STM32_UART8_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART8_RQR         (STM32_UART8_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART8_ISR         (STM32_UART8_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART8_ICR         (STM32_UART8_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART8_RDR         (STM32_UART8_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART8_TDR         (STM32_UART8_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_UART8_PRESC       (STM32_UART8_BASE + STM32_USART_PRESC_OFFSET)
#endif

#if STM32_NUART > 4
#  define STM32_UART9_CR1         (STM32_UART9_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART9_CR2         (STM32_UART9_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART9_CR3         (STM32_UART9_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART9_BRR         (STM32_UART9_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART9_GTPR        (STM32_UART9_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART9_RTOR        (STM32_UART9_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART9_RQR         (STM32_UART9_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART9_ISR         (STM32_UART9_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART9_ICR         (STM32_UART9_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART9_RDR         (STM32_UART9_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART9_TDR         (STM32_UART9_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_UART9_PRESC       (STM32_UART9_BASE + STM32_USART_PRESC_OFFSET)
#endif

