apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_uart.h
#if STM32_NUART > 5
#  define STM32_UART12_CR1         (STM32_UART12_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART12_CR2         (STM32_UART12_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART12_CR3         (STM32_UART12_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART12_BRR         (STM32_UART12_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART12_GTPR        (STM32_UART12_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART12_RTOR        (STM32_UART12_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART12_RQR         (STM32_UART12_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART12_ISR         (STM32_UART12_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART12_ICR         (STM32_UART12_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART12_RDR         (STM32_UART12_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART12_TDR         (STM32_UART12_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_UART12_PRESC       (STM32_UART12_BASE + STM32_USART_PRESC_OFFSET)
#endif

/* Register Bitfield Definitions ********************************************/

/* Control register 1 */

#define USART_CR1_UE              (1 << 0)  /* Bit 0: USART Enable */
#define USART_CR1_UESM            (1 << 1)  /* Bit 1: USART Enable in Stop mode */
#define USART_CR1_RE              (1 << 2)  /* Bit 2: Receiver Enable */
#define USART_CR1_TE              (1 << 3)  /* Bit 3: Transmitter Enable */
#define USART_CR1_IDLEIE          (1 << 4)  /* Bit 4: IDLE Interrupt Enable */
#define USART_CR1_RXNEIE          (1 << 5)  /* Bit 5: RXNE Interrupt Enable */
#define USART_CR1_TCIE            (1 << 6)  /* Bit 6: Transmission Complete Interrupt Enable */
#define USART_CR1_TXEIE           (1 << 7)  /* Bit 7: TXE Interrupt Enable */
#define USART_CR1_PEIE            (1 << 8)  /* Bit 8: PE Interrupt Enable */
#define USART_CR1_PS              (1 << 9)  /* Bit 9: Parity Selection */
#define USART_CR1_PCE             (1 << 10) /* Bit 10: Parity Control Enable */
#define USART_CR1_WAKE            (1 << 11) /* Bit 11: Wakeup method */
#define USART_CR1_M0              (1 << 12) /* Bit 12: Word length */
#define USART_CR1_MME             (1 << 13) /* Bit 13: Mute mode enable */
#define USART_CR1_CMIE            (1 << 14) /* Bit 14: Character match interrupt enable */
#define USART_CR1_OVER8           (1 << 15) /* Bit 15: Oversampling mode */

#define USART_CR1_DEDT_SHIFT      (16)      /* Bits 16..20 DE deactivation delay */
#define USART_CR1_DEDT_MASK       (0x1f << USART_CR1_DEDT_SHIFT)

#define USART_CR1_DEAT_SHIFT      (21)      /* Bits 21..25 DE activation delay */
#define USART_CR1_DEAT_MASK       (0x1f << USART_CR1_DEAT_SHIFT)

#define USART_CR1_RTOIE           (1 << 26) /* Bit 26: Receiver timeout interrupt enable */
#define USART_CR1_EOBIE           (1 << 27) /* Bit 27: End of block interrupt enable */
#define USART_CR1_M1              (1 << 28) /* Bit 28: Word length */
#define USART_CR1_FIFOEN          (1 << 29) /* Bit 29: FIFO EN */
#define USART_CR1_TXFEIE          (1 << 30) /* Bit 30: TX FIFO empty interrupt enable */
#define USART_CR1_RXFFIE          (1 << 31) /* Bit 31: RX FIFO full interrupt enable */

#define USART_CR1_ALLINTS         (USART_CR1_IDLEIE|USART_CR1_RXNEIE| \
                                   USART_CR1_TCIE|USART_CR1_TXEIE| \
                                   USART_CR1_PEIE|USART_CR1_CMIE| \
                                   USART_CR1_RTOIE|USART_CR1_EOBIE| \
                                   USART_CR1_TXFEIE|USART_CR1_RXFFIE)
#define LPUART_CR1_ALLINTS \
                                  (USART_CR1_IDLEIE | USART_CR1_RXNEIE | USART_CR1_TCIE | \
                                   USART_CR1_TXEIE | USART_CR1_PEIE | USART_CR1_CMIE | \
                                   USART_CR1_TXFEIE | USART_CR1_RXFFIE | \
                                   USART_CR1_TXFEIE | USART_CR1_RXFFIE)

/* Control register 2 */

#define USART_CR2_ADDM7           (1 << 4)  /* Bit 4: 7-bit/4-bit Address Detection */
#define USART_CR2_LBDL            (1 << 5)  /* Bit 5: LIN Break Detection Length */
#define USART_CR2_LBDIE           (1 << 6)  /* Bit 6: LIN Break Detection Interrupt Enable */
#define USART_CR2_LBCL            (1 << 8)  /* Bit 8: Last Bit Clock pulse */
#define USART_CR2_CPHA            (1 << 9)  /* Bit 9: Clock Phase */
#define USART_CR2_CPOL            (1 << 10) /* Bit 10: Clock Polarity */
#define USART_CR2_CLKEN           (1 << 11) /* Bit 11: Clock Enable */

#define USART_CR2_STOP_SHIFT      (12)      /* Bits 13-12: STOP bits */
#define USART_CR2_STOP_MASK       (3 << USART_CR2_STOP_SHIFT)
#  define USART_CR2_STOP1         (0 << USART_CR2_STOP_SHIFT) /* 00: 1 Stop bit */
#  define USART_CR2_STOP0p5       (1 << USART_CR2_STOP_SHIFT) /* 01: 0.5 Stop bit */
#  define USART_CR2_STOP2         (2 << USART_CR2_STOP_SHIFT) /* 10: 2 Stop bits */
#  define USART_CR2_STOP1p5       (3 << USART_CR2_STOP_SHIFT) /* 11: 1.5 Stop bit */

#define USART_CR2_LINEN           (1 << 14) /* Bit 14: LIN mode enable */
#define USART_CR2_SWAP            (1 << 15) /* Bit 15: Swap TX/RX pins */
#define USART_CR2_RXINV           (1 << 16) /* Bit 16: RX pin active level inversion */
#define USART_CR2_TXINV           (1 << 17) /* Bit 17: TX pin active level inversion */
#define USART_CR2_DATAINV         (1 << 18) /* Bit 18: Binary data inversion */
#define USART_CR2_MSBFIRST        (1 << 19) /* Bit 19: Most significant bit first */
#define USART_CR2_ABREN           (1 << 20) /* Bit 20: Auto Baud rate enable */

#define USART_CR2_ABRMOD_SHIFT    (21)      /* Bits 21-22: Autobaud rate mode*/
#define USART_CR2_ABRMOD_MASK     (3 << USART_CR2_ABRMOD_SHIFT)
#define USART_CR2_ABRMOD_START    (0 << USART_CR2_ABRMOD_SHIFT) /* 00: Start bit */
#define USART_CR2_ABRMOD_EDGES    (1 << USART_CR2_ABRMOD_SHIFT) /* 01: Falling-to-falling edge -> frame must start with 10xxxxxx */
#define USART_CR2_ABRMOD_7F       (2 << USART_CR2_ABRMOD_SHIFT) /* 10: 0x7F */
#define USART_CR2_ABRMOD_55       (3 << USART_CR2_ABRMOD_SHIFT) /* 11: 0x55 */

#define USART_CR2_RTOEN           (1 << 23) /* Bit 23: Receiver timeout enable */

#define USART_CR2_ADD_SHIFT       (24)      /* Bits 24-31: Address of the USART node */
#define USART_CR2_ADD_MASK        (0xff << USART_CR2_ADD_SHIFT)

/* Control register 3 */

#define USART_CR3_EIE             (1 << 0)                   /* Bit 0: Error Interrupt Enable */
#define USART_CR3_IREN            (1 << 1)                   /* Bit 1: IrDA mode Enable */
#define USART_CR3_IRLP            (1 << 2)                   /* Bit 2: IrDA Low-Power */
#define USART_CR3_HDSEL           (1 << 3)                   /* Bit 3: Half-Duplex Selection */
#define USART_CR3_NACK            (1 << 4)                   /* Bit 4: Smartcard NACK enable */
#define USART_CR3_SCEN            (1 << 5)                   /* Bit 5: Smartcard mode enable */
#define USART_CR3_DMAR            (1 << 6)                   /* Bit 6: DMA Enable Receiver */
#define USART_CR3_DMAT            (1 << 7)                   /* Bit 7: DMA Enable Transmitter */
#define USART_CR3_RTSE            (1 << 8)                   /* Bit 8: RTS Enable */
#define USART_CR3_CTSE            (1 << 9)                   /* Bit 9: CTS Enable */
#define USART_CR3_CTSIE           (1 << 10)                  /* Bit 10: CTS Interrupt Enable */
#define USART_CR3_ONEBIT          (1 << 11)                  /* Bit 11: One sample bit method Enable */
#define USART_CR3_OVRDIS          (1 << 12)                  /* Bit 12: Overrun Disable */
#define USART_CR3_DDRE            (1 << 13)                  /* Bit 13: DMA disable on Reception error */
#define USART_CR3_DEM             (1 << 14)                  /* Bit 14: Driver Enable mode */
#define USART_CR3_DEP             (1 << 15)                  /* Bit 15: Driver Enable polarity selection */
#define USART_CR3_SCARCNT2_SHIFT  (17)                       /* Bits 17-19: Smart card auto retry count */
#define USART_CR3_SCARCNT2_MASK   (7 << USART_CR3_SCARCNT2_SHIFT)
#define USART_CR3_WUS_SHIFT       (20)                       /* Bits 20-21: Wakeup from Stop mode interrupt flag selection */
#define USART_CR3_WUS_MASK        (3 << USART_CR3_WUS_SHIFT)
#define USART_CR3_WUS_ADDRESS     (0 << USART_CR3_WUS_SHIFT) /* 00: WUF active on address match */
#define USART_CR3_WUS_START       (2 << USART_CR3_WUS_SHIFT) /* 10: WUF active on Start bit detection */
#define USART_CR3_WUS_RXNE        (3 << USART_CR3_WUS_SHIFT) /* 11: WUF active on RXNE */
#define USART_CR3_WUFIE           (1 << 22)                  /* Bit 22: Wakeup from Stop mode interrupt enable */
#define USART_CR3_TXFTIE          (1 << 23)                  /* Bit 23: TXFIFO threshold interrupt enable */
#define USART_CR3_TCBGTIE         (1 << 24)                  /* Bit 24: Transmission Complete before guard time, interrupt enable */
#define USART_CR3_RXFTCFG_SHIFT   (25)                       /* Bits 25-27: Receive FIFO threshold configuration */
#define USART_CR3_RXFTCFG_MASK    (7 << USART_CR3_RXFTCFG_SHIFT)
#define USART_CR3_RXFTIE          (1 << 28)                  /* Bit 28: RXFIFO threshold interrupt enable */
#define USART_CR3_TXFTCFG_SHIFT   (29)                       /* Bits 29-31: Transmit FIFO threshold configuration */
#define USART_CR3_TXFTCFG_MASK    (7 << USART_CR3_TXFTCFG_SHIFT)

#define USART_CR3_TXFTCFG_0       (0)                        /* TX FIFO reaches 1/8 depth */
#define USART_CR3_TXFTCFG_1       (1)                        /* TX FIFO reaches 1/4 depth */
#define USART_CR3_TXFTCFG_2       (2)                        /* TX FIFO reaches 1/2 depth */
#define USART_CR3_TXFTCFG_3       (3)                        /* TX FIFO reaches 3/4 depth */
#define USART_CR3_TXFTCFG_4       (4)                        /* TX FIFO reaches 7/8 depth */
#define USART_CR3_TXFTCFG_5       (5)                        /* TX FIFO reaches full depth */

#define USART_CR3_RXFTCFG_0       (0)                        /* RX FIFO reaches 1/8 depth */
#define USART_CR3_RXFTCFG_1       (1)                        /* RX FIFO reaches 1/4 depth */
#define USART_CR3_RXFTCFG_2       (2)                        /* RX FIFO reaches 1/2 depth */
#define USART_CR3_RXFTCFG_3       (3)                        /* RX FIFO reaches 3/4 depth */
#define USART_CR3_RXFTCFG_4       (4)                        /* RX FIFO reaches 7/8 depth */
#define USART_CR3_RXFTCFG_5       (5)                        /* RX FIFO reaches full depth */

/* Baud Rate Register */

